app/views/admin/card_line_items/_list.html.erb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 35 LIMIT 1
---
        <td>
          <% if card_line_item.order.present? %>