app/views/admin/locations/_form.html.erb

    <div class="controls">
      <%= select_tag :gym_location_attributes_city, options_from_collection_for_select(City.all, :id, :name, location_form.object.city.try(:id)), id: 'city_for_dynamic_area' %>
---
SELECT `areas`.* FROM `areas` WHERE `areas`.`city_id` = 1
SELECT `cities`.* FROM `cities`