app/views/devise/registrations/new.html.erb

SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 2 LIMIT 1
---
    role = resource.role || params[:role] || ''
    agreement = role.blank? ? UserAgreement.first : UserAgreement.find(2)

SELECT `user_agreements`.* FROM `user_agreements` LIMIT 1
---

  <center><h1><%= role.blank? ? t("user_agreement") : t("venue_agreement")%></h1></center>