app/controllers/admin/activities_controller.rb

    def index
      @activities = ActivityDecorator.decorate current_gym.activities.roots.includes(:venue_type, :date_rule, :time_rule).page(params[:page]).per(15)
---
SELECT `venue_types`.* FROM `venue_types` WHERE `venue_types`.`id` IN (1)

    def show
      @activity = ActivityDecorator.decorate current_gym.activities.includes(:venue_type, :date_rule, :time_rule).find(params[:id])
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`gym_id` = 3 AND `activities`.`id` = 15 LIMIT 1
SELECT `venue_types`.* FROM `venue_types` WHERE `venue_types`.`id` IN (1)

    def create
      @activity = Activity.new(params[:activity])

      if @activity.save
---
INSERT INTO `activities` (`active`, `ancestry`, `created_at`, `description`, `display_on`, `gym_id`, `name`, `quantity`, `updated_at`, `venue_type_id`) VALUES (NULL, NULL, '2013-05-31 07:26:01', 'asdfsadf', NULL, 3, 'aseasd', 2, '2013-05-31 07:26:01', 1)

    def enable
      @activity = current_gym.activities.find(params[:id])
---
SELECT `activities`.* FROM `activities` WHERE (activities.ancestry like '15/%' or activities.ancestry = '15')

    def disable
      @activity = current_gym.activities.find(params[:id])
---
SELECT `activities`.* FROM `activities` WHERE (activities.ancestry like '17/%' or activities.ancestry = '17')