app/controllers/admin/card_types_controller.rb

    def edit
      @card_type = current_company.card_types.find(params[:id])
---
SELECT `card_types`.* FROM `card_types` WHERE `card_types`.`company_id` = 4 AND `card_types`.`id` = 2 LIMIT 1

    def create
      @card_type = CardType.new(params[:card_type])

      if @card_type.save
---
INSERT INTO `card_types` (`company_id`, `created_at`, `description`, `name`, `updated_at`) VALUES (2, '2013-06-25 05:07:55', '元泰体育----普卡', '元泰体育----普卡', '2013-06-25 05:07:55')