app/controllers/admin/card_line_items_controller.rb

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`order_id` = 65
---
    def index
      @card_line_items = current_company.card_line_items.without_order.order('created_at DESC').page(params[:page]).per(15)

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 10 AND `cards`.`id` = 8 LIMIT 1
---
    def new
      @card = current_gym.cards.find(params[:card_id])

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 10 AND `cards`.`id` = 10 LIMIT 1
INSERT INTO `card_line_items` (`amount`, `card_id`, `created_at`, `order_id`, `reason`, `updated_at`, `validity`) VALUES (-1000.0, 10, '2013-06-06 06:41:20', NULL, 'ssss', '2013-06-06 06:41:20', 0)
---
    def create
      @card = current_gym.cards.find(params[:card_id])
      @card_line_item = CardLineItem.new(params[:card_line_item].merge(card: @card))

      if @card_line_item.save