app/controllers/admin/cards_controller.rb

SELECT COUNT(*) FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 2
SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 2 LIMIT 15 OFFSET 0
---
    def index
      @q = current_gym.cards.search(params[:q])
      @cards = @q.result.page(params[:page]).per(15)

SELECT `card_line_items`.* FROM `card_line_items` WHERE `card_line_items`.`card_id` = 6 ORDER BY updated_at
SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 6 AND `cards`.`id` = 6 LIMIT 1
---
    def show
      @card = current_gym.cards.includes(:card_line_items).find(params[:id])

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 6 AND `cards`.`id` = 6 LIMIT 1
---
    def edit
      @card = current_gym.cards.find(params[:id])

INSERT INTO `cards` (`balance`, `card_type_id`, `company_id`, `created_at`, `email`, `mobile`, `number`, `sold_at`, `start_on`, `stop_on`, `updated_at`, `user_id`, `username`) VALUES (0.0, 1, 2, '2013-05-31 09:50:04', 'wyh770406@gmail.com', '', '333333', '2013-05-31 09:50:04', '2013-05-31', '2013-09-28', '2013-05-31 09:50:04', NULL, 'eee')
---
    def create
      @batch_create = params[:batch_create]

      unless @batch_create
        @card = Card.new(params[:card])
        @card.current_gym = current_gym
        if @card.save

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 6 AND `cards`.`id` = 7 LIMIT 1
---
    def update
      @card = current_gym.cards.find(params[:id])

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 2 AND `cards`.`id` = 13 LIMIT 1
DELETE FROM `cards` WHERE `cards`.`id` = 13
---
    def destroy
      @card = current_gym.cards.find(params[:id])
      @card.destroy

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 2
DELETE FROM `cards` WHERE `cards`.`id` = 1
---
    def clear_cards
      current_gym.cards.each do |card|
        card.destroy