app/controllers/admin/checkouts_controller.rb

UPDATE `orders` SET `total` = 12.0, `member_total` = 12.0, `payment_total` = 0.0, `updated_at` = '2013-05-31 01:09:52' WHERE `orders`.`type` IN ('Order::ProductOrder') AND `orders`.`id` = 64
---
    def update
      @order = current_order
      params[:order] ||= {}
      params[:order].merge!(user: current_user)

      if @order.update_attributes(params[:order])