app/controllers/admin/companies_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 5 LIMIT 1
---
    def show
      @company = Company.find(params[:id])

INSERT INTO `companies` (`address`, `created_at`, `name`, `phone`, `updated_at`) VALUES ('asdf', '2013-05-31 03:13:56', 'sadf', '18912345678', '2013-05-31 03:13:56')
---
    def create
      @company = Company.new(params[:company])

      if @company.save