app/controllers/admin/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
    def index
      @contacts = Contact.all

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
    def edit
      @contact = Contact.find(params[:id])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
    def update
      @contact = Contact.find(params[:id])