app/controllers/admin/csv_imports_controller.rb

INSERT INTO `csv_imports` (`created_at`, `csv`, `gym_id`, `import_type`, `updated_at`) VALUES ('2013-06-27 03:44:50', 'sample.csv', 11, NULL, '2013-06-27 03:44:50')
---
  	def create
      @csv_import = CsvImport.new(params[:csv_import])
  		uploaded_io = params[:csv_import][:csv]
  		current_gym_name = current_gym.name.gsub(" ","_")
  		import_type = params[:csv_import][:import_type]

  		file_name = "#{current_gym_name}_#{Time.now.strftime('%Y%m%d%H%M')}.csv"
  		file_folder = Rails.root.join('public', "uploads/#{import_type}")

  		if !File.directory?(file_folder)
  			Dir.mkdir(file_folder, 0777)
  		end

      @file = Rails.root.join('public', "uploads/#{import_type}", file_name)

			File.open(@file, 'wb') do |file|
			  file.write(uploaded_io.read)
			end

      @csv_import.csv = uploaded_io.original_filename
      @csv_import.gym = current_gym
      @csv_import.import_type = import_type

      if @csv_import.save