app/controllers/admin/gym_images_controller.rb

    def create
      @gym_image = GymImage.new(params[:gym_image])

      if @gym_image.save
---
INSERT INTO `gym_images` (`created_at`, `gym_id`, `image`, `position`, `updated_at`) VALUES ('2013-01-10 09:54:59', 1, '8lcv7ev95w9t.png', 1, '2013-01-10 09:54:59')

    def destroy
      @gym_image = @gym.images.find(params[:id])
      @gym_image.destroy
---
SELECT `gym_images`.* FROM `gym_images` WHERE `gym_images`.`gym_id` = 1 AND `gym_images`.`id` = 1 ORDER BY position LIMIT 1
DELETE FROM `gym_images` WHERE `gym_images`.`id` = 1

    def load_gym
      # TODO: check user can manage the gym
      @gym = Gym.find(params[:gym_id])
---
SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 2 AND (confirmed_at IS NOT NULL) LIMIT 1