app/controllers/admin/gym_session_controller.rb

SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 4 AND (confirmed_at IS NOT NULL) LIMIT 1
---
    def update
      gym = Gym.find(params[:id])