app/controllers/admin/gyms_controller.rb

    def index
      @gyms = current_user.is?('admin') ? Gym.scoped : current_user.gyms
      @q = @gyms.search(params[:q])
      @gyms = @q.result.uniq.page(params[:page]).per(15)
---
SELECT `gyms`.* FROM `gyms` INNER JOIN `gyms_users` ON `gyms`.`id` = `gyms_users`.`gym_id` WHERE `gyms_users`.`user_id` = 22
SELECT COUNT(*) FROM `gyms`
SELECT DISTINCT `gyms`.* FROM `gyms` LIMIT 15 OFFSET 0

    def show
      @gym = GymDecorator.decorate(Gym.includes(:venue_types, :images).find(params[:id]))
---
SELECT `gym_images`.* FROM `gym_images` WHERE `gym_images`.`gym_id` IN (1) ORDER BY position
SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 2 AND (confirmed_at IS NOT NULL) LIMIT 1
SELECT `venue_types`.* FROM `venue_types` WHERE `venue_types`.`id` IN (1, 4)

    def edit
      @gym = Gym.find(params[:id])
---
SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 10 AND (confirmed_at IS NOT NULL) LIMIT 1