app/controllers/admin/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE ((`orders`.`id` = 65 AND `orders`.`gym_id` = 10)) LIMIT 1
SELECT DISTINCT `orders`.* FROM `orders` WHERE `orders`.`gym_id` = 4 AND (`orders`.`state` NOT IN ('cart')) AND ((`orders`.`state` = 'completed' AND `orders`.`type` = 'Order::VenueOrder')) ORDER BY updated_at DESC LIMIT 15 OFFSET 0
---
    def index
      @order_klass = params[:order_klass] || params[:q].try(:[], :type_eq) || 'Order::VenueOrder'
      @order_klass = Order.subclasses.first.to_s unless Order.subclasses.map(&:to_s).include?(@order_klass)
      params[:q] = { state_eq: 'completed' } if params[:q].nil?
      params[:q][:type_eq] = @order_klass
      begin
        params[:q][:created_at_lteq] = Date.parse(params[:q][:created_at_lteq]).end_of_day unless params[:q][:created_at_lteq].blank?
      rescue
      end

      @q = current_gym.orders.without_state(:cart).search(params[:q])
      @orders = @q.result(distinct: true).order("updated_at DESC").page(params[:page]).per(15)

SELECT `orders`.* FROM `orders` WHERE `orders`.`gym_id` = 4 AND `orders`.`id` = 64 LIMIT 1
---
    def show
      @order = current_gym.orders.find(params[:id])