app/controllers/admin/payment_methods_controller.rb

    def index
      @payment_methods = PaymentMethod.page(params[:page]).per(15)
---
SELECT COUNT(*) FROM `payment_methods` WHERE `payment_methods`.`deleted_at` IS NULL
SELECT `payment_methods`.* FROM `payment_methods` WHERE `payment_methods`.`deleted_at` IS NULL LIMIT 15 OFFSET 0