app/controllers/admin/products_controller.rb

    def index
      @products = current_gym.products
      @q = @products.search(params[:q])
      @products = @q.result.page(params[:page]).per(15)
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`gym_id` = 4
SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`gym_id` = 3 LIMIT 15 OFFSET 0

    def edit
      @product = current_gym.products.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`gym_id` = 3 AND `products`.`id` = 6 LIMIT 1

    def create
      @product = Product.new(params[:product])

      if @product.save
---
INSERT INTO `products` (`count_on_hand`, `created_at`, `deleted_at`, `description`, `gym_id`, `name`, `price`, `sku`, `updated_at`) VALUES (1234, '2013-05-31 01:08:48', NULL, 'fffffr', 4, '我的商品测试', 12.0, 'w33eee', '2013-05-31 01:08:48')

    def update
      @product = current_gym.products.find(params[:id])

      if @product.update_attributes(params[:product])
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`gym_id` = 3 AND `products`.`id` = 8 LIMIT 1
UPDATE `products` SET `sku` = 'gg', `updated_at` = '2013-05-31 07:16:52' WHERE `products`.`id` = 8

    def clear_products
      current_gym.products.each do |product|
---
SELECT `products`.* FROM `products` WHERE `products`.`deleted_at` IS NULL AND `products`.`gym_id` = 11