app/controllers/admin/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 15 OFFSET 0
---
    def index
      @users = if current_user.is?(:admin)
        User.page(params[:page]).per(15)

UPDATE `users` SET `roles_mask` = 5, `updated_at` = '2013-05-31 05:43:08' WHERE `users`.`id` = 24
---
    def update
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 22 LIMIT 1
---
    def find_user
      @user = if current_user.is?(:admin)
        User.find(params[:id])

SELECT `gyms`.* FROM `gyms`
---
    def find_gyms
      @gyms = if current_user.is?(:admin)
        Gym.all