app/controllers/admin/user_agreements_controller.rb

SELECT `user_agreements`.* FROM `user_agreements`
---
    def index
      @user_agreements = UserAgreement.all

SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 1 LIMIT 1
---
    def edit
      @user_agreement = UserAgreement.find(params[:id])

SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 1 LIMIT 1
---
    def update
      @user_agreement = UserAgreement.find(params[:id])