app/controllers/admin/venues_controller.rb

SELECT `activities`.* FROM `activities` WHERE `activities`.`id` IN (4)
SELECT `venues`.* FROM `venues` INNER JOIN `activities` ON `venues`.`activity_id` = `activities`.`id` WHERE `activities`.`gym_id` = 3 AND ((`activities`.`venue_type_id` = 1 AND `venues`.`start_at` BETWEEN '2013-05-30 16:00:00' AND '2013-05-31 15:59:59' AND `venues`.`stop_at` BETWEEN '2013-05-30 16:00:00' AND '2013-05-31 15:59:59')) ORDER BY `venues`.`start_at`, `venues`.`stop_at`
SELECT `venue_types`.* FROM `venue_types` INNER JOIN `venue_inventories` ON `venue_types`.`id` = `venue_inventories`.`venue_type_id` WHERE `venue_inventories`.`gym_id` = 3 LIMIT 1
---
    def index
      @view_type = params[:view_type] || 'grid'
      @on_date = begin
        Date.parse(params[:on_date])
      rescue
        Date.today
      end
      @venue_type = begin
        VenueType.find(params[:venue_type_id])
      rescue
        current_gym.venue_types.first
      end
      @venues = current_gym.venues.includes(:activity).available.where('activities.venue_type_id' => @venue_type.id, start_at: @on_date.to_time.all_day, stop_at: @on_date.to_time.all_day).order(:start_at, :stop_at)
      @venue_groups = @venues.group_by { |v| { start_at: v.start_at, stop_at: v.stop_at } }