app/controllers/admin/venues_controller.rb

    def index
      @on_date = begin
        Date.parse(params[:on_date])
      rescue
        Date.today
      end
      @venue_type = begin
        VenueType.find(params[:venue_type_id])
      rescue
        current_gym.venue_types.first
      end
      @venues = current_gym.venues.includes(:activity).where('venues.active' => 1, 'activities.venue_type_id' => @venue_type.id, start_at: @on_date.to_time.all_day, stop_at: @on_date.to_time.all_day).order(:start_at, :stop_at)
---
SELECT `venues`.* FROM `venues` INNER JOIN `activities` ON `venues`.`activity_id` = `activities`.`id` WHERE `activities`.`gym_id` = 10 AND ((`venues`.`active` = 1 AND `activities`.`venue_type_id` = 1 AND `venues`.`start_at` BETWEEN '2013-06-05 16:00:00' AND '2013-06-06 15:59:59' AND `venues`.`stop_at` BETWEEN '2013-06-05 16:00:00' AND '2013-06-06 15:59:59')) ORDER BY `venues`.`start_at`, `venues`.`stop_at`