app/controllers/admin/venue_types_controller.rb

SELECT `venue_types`.* FROM `venue_types`
---
    def index
      @venue_types = VenueType.all