app/views/admin/companies/show.html.erb


<% if @company.gyms.blank? && can?(:create, Gym) %>
---
SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`company_id` = 5