app/views/home/_gyms.html.erb

SELECT `gyms`.* FROM `gyms` INNER JOIN `venue_inventories` ON `gyms`.`id` = `venue_inventories`.`gym_id` WHERE `venue_inventories`.`venue_type_id` = 1 AND (confirmed_at IS NOT NULL)
---
          <ol>
            <% venue_type.gyms.each do |gym| %>