app/views/venues/_grid.html.erb

          <% venues.each do |venue| %>
            <% if venue.real_venues.count > 0 %>
---
SELECT COUNT(*) FROM `real_venues` WHERE `real_venues`.`venue_id` = 9987

                  <td class="item">
                    <%= link_to populate_cart_path(type: 'Order::VenueOrder', items_attributes: [ real_venue.to_line_item ], gym_id: gym.id), method: :post, title: venue.activity.venue_rule.class.model_name.human, data: { content: "#{t('price')}: #{number_to_currency(venue.price)}, #{t('member_price')}: #{number_to_currency(venue.member_price)}, #{RealVenue.human_attribute_name(:count_on_hand)}: #{real_venue.count_on_hand}, #{RealVenue.human_attribute_name(:max_people)}: #{real_venue.max_people}" }, remote: true do %>
---
SELECT `venue_rules`.* FROM `venue_rules` WHERE `venue_rules`.`activity_id` = 3 LIMIT 1