app/views/admin/cards/_form.html.erb

SELECT `cards`.* FROM `cards` INNER JOIN `card_types` ON `cards`.`card_type_id` = `card_types`.`id` INNER JOIN `card_types_gym_groups` ON `card_types`.`id` = `card_types_gym_groups`.`card_type_id` INNER JOIN `gym_groups` ON `card_types_gym_groups`.`gym_group_id` = `gym_groups`.`id` INNER JOIN `gym_groups_gyms` ON `gym_groups`.`id` = `gym_groups_gyms`.`gym_group_id` WHERE `gym_groups_gyms`.`gym_id` = 6 AND `cards`.`id` = 6 LIMIT 1
---
  <%total_gyms = []
    current_gym.card_types.each do |card_type|