app/views/gyms/_list.html.erb

      <tr>
        <td class="image"><%= image_tag(gym.key_image.image_url(:small).to_s) unless gym.key_image.blank? %></td>
---
SELECT `gym_images`.* FROM `gym_images` WHERE `gym_images`.`gym_id` = 2 ORDER BY position LIMIT 1