app/views/cards/_new_cards.html.erb

SELECT COUNT(*) FROM `cards` WHERE `cards`.`user_id` = 22 AND `cards`.`card_type_id` = 1
---
          <td class="controls">
            <% if user_signed_in? && current_user.cards.by_type(card_type).count > 0 %>