app/views/admin/card_types/index.html.erb

SELECT `gym_groups`.* FROM `gym_groups` INNER JOIN `card_types_gym_groups` ON `gym_groups`.`id` = `card_types_gym_groups`.`gym_group_id` WHERE `card_types_gym_groups`.`card_type_id` = 1
---
      <td><%= card_type.name %></td>
      <td><%= card_type.gym_groups.map(&:name).join(', ') %></td>