app/views/admin/line_items/_list.html.erb

  <tbody>
    <% order.line_items.each do |line_item| %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`order_id` = 64