app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
  def show
  	@id = params[:id]
  	@contact = Contact.find(params[:id])