app/controllers/gyms_controller.rb

SELECT `gyms`.* FROM `gyms`
---
  def search
    gyms_in_area = @venue_type.gyms.in_areas(@areas).name_contains(@gym_name)
    @gyms = gyms_in_area.map { |gym|

SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `activities` WHERE `activities`.`gym_id` = 2
SELECT `activities`.* FROM `activities` WHERE `activities`.`gym_id` = 2 LIMIT 1
---
  def show
    @gym = Gym.find(params[:id])
    @activity = @gym.activities.first unless @gym.activities.empty?

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 6 LIMIT 1
SELECT `venue_types`.* FROM `venue_types` WHERE `venue_types`.`id` = 1 LIMIT 1
---
  def load_params
    @city = City.find(params[:city_id])
    @areas = unless params[:area_id].blank?
      @area = Area.find(params[:area_id])
      [@area]
    else
      @city.areas
    end
    @venue_type = VenueType.find(params[:venue_type_id])