app/controllers/registrations_controller.rb

  def new
    @role = params[:role]
    @agreement = @role ? UserAgreement.find(2) : UserAgreement.first
---
SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 2 LIMIT 1

  def create
    @role = params[:role]
    @agreement = @role ? UserAgreement.find(2) : UserAgreement.first
---
SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 2 LIMIT 1