app/controllers/registrations_controller.rb

SELECT `user_agreements`.* FROM `user_agreements` LIMIT 1
---
  def new
  	@role = params[:role]
  	@user_agreement = UserAgreement.first

SELECT `user_agreements`.* FROM `user_agreements` LIMIT 1
---
  def create
  	@role = params[:role]
  	@user_agreement = UserAgreement.first