app/controllers/user_agreements_controller.rb

  def index
  	@user_agreement = UserAgreement.first
  	@venue_agreement = UserAgreement.find(2)
---
SELECT `user_agreements`.* FROM `user_agreements` LIMIT 1
SELECT `user_agreements`.* FROM `user_agreements` WHERE `user_agreements`.`id` = 2 LIMIT 1