app/controllers/venues_controller.rb

SELECT `gyms`.* FROM `gyms` WHERE `gyms`.`id` = 2 LIMIT 1
SELECT `venue_types`.* FROM `venue_types` WHERE `venue_types`.`id` = 1 LIMIT 1
SELECT `venue_types`.* FROM `venue_types` INNER JOIN `venue_inventories` ON `venue_types`.`id` = `venue_inventories`.`venue_type_id` WHERE `venue_inventories`.`gym_id` = 2
SELECT COUNT(*) FROM `real_venues` WHERE `real_venues`.`venue_id` = 9987
---
  def search
    @gym = Gym.find(params[:gym_id])
    @date = Date.parse(params[:date])
    @venue_type = VenueType.find(params[:venue_type_id])

    @venues = Venue.includes(:activity).active.where("activities.gym_id" => @gym.id, "activities.venue_type_id" => @venue_type.id, :start_at => @date.beginning_of_day..@date.end_of_day).order(:start_at)
    @venue_groups = @venues.group_by { |v| { start_at: v.start_at, stop_at: v.stop_at } }
    @activity_max_published_to = @gym.activities.map{|activity| activity.published_to}.compact.max unless @gym.activities.empty?