app/views/admin/users/index.html.erb

      <td>
        <% user.gyms.each do |gym| %>
---
SELECT `gyms`.* FROM `gyms` INNER JOIN `gyms_users` ON `gyms`.`id` = `gyms_users`.`gym_id` WHERE `gyms_users`.`user_id` = 1

      </td>
      <td class="control span2"><%= user.roles.empty? ? t(:user, scope: "roles") : user.roles.map { |role| t(role, scope: "roles") }.join(', ') %></td>
---
SELECT COUNT(*) FROM `users`