app/views/admin/users/show.html.erb

      <td>
        <% @user.gyms.each do |gym| %>
---
SELECT `gyms`.* FROM `gyms` INNER JOIN `gyms_users` ON `gyms`.`id` = `gyms_users`.`gym_id` WHERE `gyms_users`.`user_id` = 3