app/views/admin/shared/_topnav.html.erb

              <ul class="dropdown-menu">
                <% if current_company && current_user.gyms.size > 0 %>
---
SELECT `gyms`.* FROM `gyms` INNER JOIN `gyms_users` ON `gyms`.`id` = `gyms_users`.`gym_id` WHERE `gyms_users`.`user_id` = 22